therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EVENTLP</name>
            <groupName>EVENTLP</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x400C9000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EVENTLP_PUBCFG_DESC_EX</name>
                    <description>Extended Module Description</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_SINGLE_CHANNEL</name>
                            <description>Number of single channels contained in this instance of event manager</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_DUAL_CHANNEL</name>
                            <description>Number of dual channels contained in this instance of event manager</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_IMPORT</name>
                            <description>Number of import ports available in this EventManager instantiation</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_EXPORT</name>
                            <description>Number of export ports available in this EventManager instantiation</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>EVENTLP_PUBCFG_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>128</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_FSUB[%s]</name>
                    <description></description>
                    <addressOffset>0x100</addressOffset>
                    <register>
                        <dim>32</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimArrayIndex>
                        <name>EVENTLP_PUBCFG_FSUB_PORT[%s]</name>
                        <description>Subscriber channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for subscriber to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>104</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_FPUB[%s]</name>
                    <description></description>
                    <addressOffset>0x300</addressOffset>
                    <register>
                        <dim>26</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25</dimArrayIndex>
                        <name>EVENTLP_PUBCFG_FPUB_PORT[%s]</name>
                        <description>Publisher channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for publisher to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x500</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for export side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x700</addressOffset>
                    <register>
                        <name>EVENTLP_PUBCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>128</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_PUBCFG_CPU_CONNECT[%s]</name>
                    <description></description>
                    <addressOffset>0x900</addressOffset>
                    <register>
                        <dim>32</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimArrayIndex>
                        <name>EVENTLP_PUBCFG_CPU_NUM[%s]</name>
                        <description>CPU connect register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CPUSS0_CONN</name>
                                <description>CPUSS0 connect bit.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>UNCONNECTED</name>
                                            <description>The CPU is not connected.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CONNECTED</name>
                                            <description>The CPU is connected.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>EVENTLP_SECCFG_DESC_EX</name>
                    <description>Extended Module Description</description>
                    <addressOffset>0x10F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_SINGLE_CHANNEL</name>
                            <description>Number of single channels contained in this instance of event manager</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_DUAL_CHANNEL</name>
                            <description>Number of dual channels contained in this instance of event manager</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_EXPORT</name>
                            <description>Number of export ports available in this EventManager instantiation</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                        <field>
                            <name>NUM_IMPORT</name>
                            <description>Number of import ports available in this EventManager instantiation</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>EVENTLP_SECCFG_DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            </field>
                        <field>
                            <name>MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>32</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_FSUB[%s]</name>
                    <description></description>
                    <addressOffset>0x1100</addressOffset>
                    <register>
                        <dim>32</dim>
                        <dimIncrement>1</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimArrayIndex>
                        <name>EVENTLP_SECCFG_FSUB_PORT[%s]</name>
                        <description>Subscriber channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for subscriber to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>26</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_FPUB[%s]</name>
                    <description></description>
                    <addressOffset>0x1180</addressOffset>
                    <register>
                        <dim>26</dim>
                        <dimIncrement>1</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25</dimArrayIndex>
                        <name>EVENTLP_SECCFG_FPUB_PORT[%s]</name>
                        <description>Publisher channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for publisher to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>1</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x1200</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for export side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>1</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x1280</addressOffset>
                    <register>
                        <name>EVENTLP_SECCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>32</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_SECCFG_CPU_CONNECT[%s]</name>
                    <description></description>
                    <addressOffset>0x1300</addressOffset>
                    <register>
                        <dim>32</dim>
                        <dimIncrement>1</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimArrayIndex>
                        <name>EVENTLP_SECCFG_CPU_NUM[%s]</name>
                        <description>CPU connect register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>8</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CPUSS0_CONN</name>
                                <description>CPUSS0 connect bit.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>UNCONNECTED</name>
                                            <description>The CPU is not connected.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CONNECTED</name>
                                            <description>The CPU is connected.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
