therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                    <register>
                        <name>EVENTLP_DIAGIFRST</name>
                        <description>Diagnostic Interface Reset Register</description>
                        <addressOffset>0x3F4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTIFRST</name>
                                <description>Writing a 1 will synchronously clear the Diagnostic Interface. The STICKY bits for status and well as the PARFV will be cleared. If a true functional failure still exists, the interface will re-assert FUNCFAIL on the cycle following the interface reset</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DIAGPASSCLR</name>
                                <description>Writing a 1 will synchronously clear the PARFV MMR DPINDEX field. The STICKY bit for DIAGPASS status will be cleared as well.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPARFV</name>
                        <description>Diagnostic Parity Fail Vector Register</description>
                        <addressOffset>0x3F8</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>INDEX</name>
                                <description>Index of DIAG MMR creating the failure. NOTE: INDEX value of 1 corresponds to DIAGPAR0, 2 corresponds to DIAGPAR1 and so on.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xA</bitWidth>
                                </field>
                            <field>
                                <name>DPINDEX</name>
                                <description>Index of DIAG PASS MMR. NOTE: DPINDEX value of 1 corresponds to DIAGPAR0, 2 corresponds to DIAGPAR1 and so on.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0xA</bitWidth>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGSTAT</name>
                        <description>Diagnostic Status Register</description>
                        <addressOffset>0x3FC</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x03010000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>STATE</name>
                                <description>Current diagnostic state</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NONE</name>
                                            <description>No failures and no diagnostic</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FUNC_FAIL</name>
                                            <description>Functional Failure</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DIAG_FAIL</name>
                                            <description>Diagnostic Failure</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DIAG_PASS</name>
                                            <description>Diagnostic Pass</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>NUMDIAG</name>
                                <description>This is a hardware constant that indicates how many DIAGPAR registers are included in this SFTYDIAG sub-region.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0xA</bitWidth>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_IMPEXPCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x2000</addressOffset>
                    <register>
                        <name>EVENTLP_IMPEXPCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_IMPEXPCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x2200</addressOffset>
                    <register>
                        <name>EVENTLP_IMPEXPCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
