therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                <register>
                    <name>FLASHCTL_STATMODE</name>
                    <description>Mode Status Register</description>
                    <addressOffset>0x13DC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>BANKNOTINRD</name>
                            <description>Bank not in read mode.
Indicates which banks are not in READ mode.  There is 1 bit per bank.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BANK0</name>
                                        <description>Bank 0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK1</name>
                                        <description>Bank 1</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK2</name>
                                        <description>Bank 2</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK3</name>
                                        <description>Bank 3</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BANK4</name>
                                        <description>Bank 4</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BANKMODE</name>
                            <description>Indicates mode of bank(s) that are not in READ mode</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READ</name>
                                        <description>Read Mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG0</name>
                                        <description>Read Margin 0 Mode</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG1</name>
                                        <description>Read Margin 1 Mode</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG0B</name>
                                        <description>Read Margin 0B Mode</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG1B</name>
                                        <description>Read Margin 1B Mode</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMVER</name>
                                        <description>Program Verify Mode</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMSW</name>
                                        <description>Program Single Word</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASEVER</name>
                                        <description>Erase Verify Mode</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASESECT</name>
                                        <description>Erase Sector</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMMW</name>
                                        <description>Program Multiple Word</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASEBNK</name>
                                        <description>Erase Bank</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BANK2TRDY</name>
                            <description>Bank 2T Ready.
Bank(s) are ready for 2T access.  This is accomplished when the pump has
fully driven power rails to the bank(s).</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>Not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BANK1TRDY</name>
                            <description>Bank 1T Ready.
Bank(s) are ready for 1T access.  This is accomplished when the bank and pump
have been trimmed.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>Not ready</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_GBLINFO0</name>
                    <description>Global Information Register 0</description>
                    <addressOffset>0x13F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>SECTORSIZE</name>
                            <description>Sector size in bytes</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ONEKB</name>
                                        <description>Sector size is ONEKB</description>
                                        <value>0x400</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TWOKB</name>
                                        <description>Sector size is TWOKB</description>
                                        <value>0x800</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>NUMBANKS</name>
                            <description>Number of banks instantiated
Minimum:	1
Maximum:	5</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_GBLINFO1</name>
                    <description>Global Information Register 1</description>
                    <addressOffset>0x13F4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DATAWIDTH</name>
                            <description>Data width in bits</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>W64BIT</name>
                                        <description>Data width is 64 bits</description>
                                        <value>0x40</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>W128BIT</name>
                                        <description>Data width is 128 bits</description>
                                        <value>0x80</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ECCWIDTH</name>
                            <description>ECC data width in bits</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>W0BIT</name>
                                        <description>ECC data width is 0.  ECC not used.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>W8BIT</name>
                                        <description>ECC data width is 8 bits</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>W16BIT</name>
                                        <description>ECC data width is 16 bits</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REDWIDTH</name>
                            <description>Redundant data width in bits</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>W0BIT</name>
                                        <description>Redundant data width is 0.  Redundancy/Repair not present.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>W2BIT</name>
                                        <description>Redundant data width is 2 bits</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>W4BIT</name>
                                        <description>Redundant data width is 4 bits</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_GBLINFO2</name>
                    <description>Global Information Register 2</description>
                    <addressOffset>0x13F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DATAREGISTERS</name>
                            <description>Number of data registers present.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK0INFO0</name>
                    <description>Bank Information Register 0 for Bank 0</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MAINSIZE</name>
                            <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [MAINSIZE]</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [MAINSIZE]</description>
                                        <value>0x200</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_BANK0INFO1</name>
                    <description>Bank Information Register 1 for Bank 0</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NONMAINSIZE</name>
                            <description>Non-main region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [NONMAINSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [NONMAINSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIMSIZE</name>
                            <description>Trim region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [TRIMSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [TRIMSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENGRSIZE</name>
                            <description>Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [ENGRSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [ENGRSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
