therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                <register>
                    <name>RTC_A1MIN</name>
                    <description>RTC Minute Alarm Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AMINBIN</name>
                            <description>Alarm Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AMINAEBIN</name>
                            <description>Alarm Minutes Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>AMINLOWBCD</name>
                            <description>Alarm Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AMINHIGHBCD</name>
                            <description>Alarm Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AMINAEBCD</name>
                            <description>Alarm Minutes BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_A1HOUR</name>
                    <description>RTC Hours Alarm Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AHOURBIN</name>
                            <description>Alarm Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AHOURAEBIN</name>
                            <description>Alarm Hours Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>AHOURLOWBCD</name>
                            <description>Alarm Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AHOURHIGHBCD</name>
                            <description>Alarm Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0..</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AHOURAEBCD</name>
                            <description>Alarm Hours BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_A1DAY</name>
                    <description>RTC Alarm Day Of Week / Month Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADOW</name>
                            <description>Alarm Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>ADOWAE</name>
                            <description>Alarm Day of week enable. This bit are valid if RTCBCD=1 or RTCBCD=0.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ADOMBIN</name>
                            <description>Alarm Day of month Binary (1 to 28, 29, 30, 31) If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>ADOMAEBIN</name>
                            <description>Alarm Day of month Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ADOMLOWBCD</name>
                            <description>Alarm Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>ADOMHIGHBCD</name>
                            <description>Alarm Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>ADOMAEBCD</name>
                            <description>Alarm Day of month BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_A2MIN</name>
                    <description>RTC Minute Alarm Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AMINBIN</name>
                            <description>Alarm Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AMINAEBIN</name>
                            <description>Alarm Minutes Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>AMINLOWBCD</name>
                            <description>Alarm Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AMINHIGHBCD</name>
                            <description>Alarm Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AMINAEBCD</name>
                            <description>Alarm Minutes BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_A2HOUR</name>
                    <description>RTC Hours Alarm Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AHOURBIN</name>
                            <description>Alarm Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AHOURAEBIN</name>
                            <description>Alarm Hours Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>AHOURLOWBCD</name>
                            <description>Alarm Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AHOURHIGHBCD</name>
                            <description>Alarm Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0..</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>AHOURAEBCD</name>
                            <description>Alarm Hours BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Alarm disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Alarm enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
