therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                <cluster>
                    <dim>7</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6</dimArrayIndex>
                    <name>DMA_DMATRIG[%s]</name>
                    <description></description>
                    <addressOffset>0x1110</addressOffset>
                    <register>
                        <name>DMA_DMATCTL</name>
                        <description>DMA Trigger Select</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>DMATSEL</name>
                                <description>DMA Trigger Select 

Note: Reference the datasheet of the device to see the specific trigger mapping.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x6</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DMAREQ</name>
                                            <description>Software trigger request</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMATINT</name>
                                <description>DMA Trigger by Internal Channel</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>EXTERNAL</name>
                                            <description>DMATSEL will define external trigger select as transfer trigger.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INTERNAL</name>
                                            <description>DMATSEL will define internal channel as transfer trigger select. 0-&gt; Channel0-done, 1-&gt; Channel1-done, ...</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>7</dim>
                    <dimIncrement>16</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6</dimArrayIndex>
                    <name>DMA_DMACHAN[%s]</name>
                    <description></description>
                    <addressOffset>0x1200</addressOffset>
                    <register>
                        <name>DMA_DMACTL</name>
                        <description>DMA Channel Control</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>DMAREQ</name>
                                <description>DMA request. Software-controlled DMA start. DMAREQ is reset automatically.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>IDLE</name>
                                            <description>Default read value</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REQUEST</name>
                                            <description>DMA transfer request (start DMA)</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMAEN</name>
                                <description>DMA enable</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>DMA channel disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>DMA channel enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMASRCWDTH</name>
                                <description>DMA source width. This bit selects the source data width as a byte, half word, word or long word.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>BYTE</name>
                                            <description>Source data width is BYTE (8-bit)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HALF</name>
                                            <description>Source data width is HALF-WORD (16-bit)</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>WORD</name>
                                            <description>Source data width is WORD (32-bit)</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LONG</name>
                                            <description>Source data width is LONG-WORD (64-bit)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMADSTWDTH</name>
                                <description>DMA destination width. This bit selects the destination as a byte, half word, word or long word.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>BYTE</name>
                                            <description>Destination data width is BYTE (8-bit)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HALF</name>
                                            <description>Destination data width is HALF-WORD (16-bit)</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>WORD</name>
                                            <description>Destination data width is WORD (32-bit)</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LONG</name>
                                            <description>Destination data width is LONG-WORD (64-bit)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMASRCINCR</name>
                                <description>DMA source increment. This bit selects automatic incrementing or decrementing of the source address DMASA for each transfer. The amount of change to the DMASA is based on the definitin in the DMASRCWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMASA by 4.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>UNCHANGED</name>
                                            <description>Address is unchanged (+0)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DECREMENT</name>
                                            <description>Decremented by 1 (-1 * DMASRCWDTH)</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INCREMENT</name>
                                            <description>Incremented by 1 (+1 * DMASRCWDTH)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_2</name>
                                            <description>Stride size 2 (+2 * DMASRCWDTH)</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_3</name>
                                            <description>Stride size 3 (+3 * DMASRCWDTH)</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_4</name>
                                            <description>Stride size 4 (+4 * DMASRCWDTH)</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_5</name>
                                            <description>Stride size 5 (+5 * DMASRCWDTH)</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_6</name>
                                            <description>Stride size 6 (+6 * DMASRCWDTH)</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_7</name>
                                            <description>Stride size 7 (+7 * DMASRCWDTH)</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_8</name>
                                            <description>Stride size 8 (+8 * DMASRCWDTH)</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_9</name>
                                            <description>Stride size 9 (+9 * DMASRCWDTH)</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMADSTINCR</name>
                                <description>DMA destination increment. This bit selects automatic incrementing or decrementing of the destination address DMADA for each transfer. The amount of change to the DMADA is based on the definitin in the DMADSTWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMADA by 4.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>UNCHANGED</name>
                                            <description>Address is unchanged (+0)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DECREMENT</name>
                                            <description>Decremented by 1 (-1 * DMADSTWDTH)</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INCREMENT</name>
                                            <description>Incremented by 1 (+1 * DMADSTWDTH)</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_2</name>
                                            <description>Stride size 2 (+2 * DMADSTWDTH)</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_3</name>
                                            <description>Stride size 3 (+3 * DMADSTWDTH)</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_4</name>
                                            <description>Stride size 4 (+4 * DMADSTWDTH)</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_5</name>
                                            <description>Stride size 5 (+5 * DMADSTWDTH)</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_6</name>
                                            <description>Stride size 6 (+6 * DMADSTWDTH)</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_7</name>
                                            <description>Stride size 7 (+7 * DMADSTWDTH)</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_8</name>
                                            <description>Stride size 8 (+8 * DMADSTWDTH)</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STRIDE_9</name>
                                            <description>Stride size 9 (+9 * DMADSTWDTH)</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMATM</name>
                                <description>DMA transfer mode register

