therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                    <register>
                        <name>TIMA1_FSCTL</name>
                        <description>Fault Source Control</description>
                        <addressOffset>0x20</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>FCEN</name>
                                <description>This field controls whether the fault caused by the system clock fault is enable.
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FAC0EN</name>
                                <description>This field controls whether the fault signal detected by the analog comparator0 is enable
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FAC1EN</name>
                                <description>This field controls whether the fault signal detected by the analog comparator1 is enable
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FAC2EN</name>
                                <description>This field controls whether the fault signal detected by the analog comparator2 is enable
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FEX0EN</name>
                                <description>This field controls whether the fault caused by external fault pin0 is enable.
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FEX1EN</name>
                                <description>This field controls whether the fault caused by external fault pin1 is enable.
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FEX2EN</name>
                                <description>This field controls whether the fault caused by external fault pin2 is enable.
0: DISABLE
1: ENABLE</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_GCTL</name>
                        <description>Shadow to active load mask</description>
                        <addressOffset>0x24</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>SHDWLDEN</name>
                                <description>Enables shadow to active load of bufferred registers and register fields.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>216</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>TIMA1_COUNTERREGS[%s]</name>
                    <description></description>
                    <addressOffset>0x1800</addressOffset>
                    <register>
                        <name>TIMA1_CTR</name>
                        <description>Counter Register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCTR</name>
                                <description>Current Counter value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
