therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WUC</name>
            <groupName>WUC</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40424000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x500</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>WUC_FSUB_0</name>
                    <description>Subscriber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>WUC_FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC0</name>
            <groupName>ADC</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ADC0_FSUB_0</name>
                    <description>Subscriber Configuration Register.</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>ADC0_FPUB_1</name>
                    <description>Publisher Configuration Register.</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNCONNECTED</name>
                                        <description>A value of 0 specifies that the event is not connected</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>24</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>ADC0_GPRCM[%s]</name>
                    <description></description>
                    <addressOffset>0x800</addressOffset>
                    <register>
                        <name>ADC0_PWREN</name>
                        <description>Power enable</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>ENABLE</name>
                                <description>Enable the power</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable Power</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable Power</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>ADC0_RSTCTL</name>
                        <description>Reset Control</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RESETSTKYCLR</name>
                                <description>Clear the RESETSTKY bit in the STAT register</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear reset sticky bit</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RESETASSERT</name>
                                <description>Assert reset to the peripheral</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ASSERT</name>
                                            <description>Assert reset</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>ADC0_CLKCFG</name>
                        <description>ADC clock configuration Register</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>SAMPCLK</name>
                                <description>ADC sample clock source selection.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SYSOSC</name>
                                            <description>SYSOSC is the source of ADC sample clock.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ULPCLK</name>
                                            <description>ULPCLK is the source of ADC sample clock.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HFCLK</name>
                                            <description>HFCLK clock is the source of ADC sample clock.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCONRUN</name>
                                <description>CCONRUN: Forces SYSOSC to run at base frequency when device is in RUN mode which can be used as ADC sample or conversion clock source.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>ADC conversion clock source is not kept continuously on during RUN mode.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>ADC conversion clock source kept continuously on during RUN mode.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCONSTOP</name>
                                <description>CCONSTOP: Forces SYSOSC to run at base frequency when device is in STOP mode which can be used as ADC sample or conversion clock source.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>ADC conversion clock source is not kept continuously on during STOP mode.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>ADC conversion clock source kept continuously on during STOP mode.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>ADC0_STAT</name>
                        <description>Status Register</description>
                        <addressOffset>0x14</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>RESETSTKY</name>
                                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NORES</name>
                                            <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RESET</name>
                                            <description>The peripheral was reset since the last bit clear</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
