therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG0_IFCTL_01[%s]</name>
                        <description>Input Filter Control Register</description>
                        <addressOffset>0x80</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ISEL</name>
                                <description>Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCPX_INPUT</name>
                                            <description>CCP of the corresponding capture compare unit</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCPX_INPUT_PAIR</name>
                                            <description>Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP0_INPUT</name>
                                            <description>CCP0 of the counter</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG_INPUT</name>
                                            <description>Trigger</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_XOR</name>
                                            <description>XOR of CCP inputs as input source.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FSUB0</name>
                                            <description>subscriber 0 event as input source.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FSUB1</name>
                                            <description>subscriber 1 event as input source.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>COMP0</name>
                                            <description>Comparator 0 output.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>COMP1</name>
                                            <description>Comparator 1 output.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>COMP2</name>
                                            <description>Comparator 2 output.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>INV</name>
                                <description>Input Inversion This bit controls whether the selected input is inverted.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOINVERT</name>
                                            <description>Noninverted</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INVERT</name>
                                            <description>Inverted</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FP</name>
                                <description>Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>_3</name>
                                            <description>The division factor is 3</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>_5</name>
                                            <description>The division factor is 5</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>_8</name>
                                            <description>The division factor is 8</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CPV</name>
                                <description>Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>Consecutive</name>
                                            <description>Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Voting</name>
                                            <description>Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FE</name>
                                <description>Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Bypass.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Filtered.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMG0_TSEL</name>
                        <description>Trigger Select</description>
                        <addressOffset>0xB0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ETSEL</name>
                                <description>External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x5</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>TRIG0</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG1</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG2</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG3</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG4</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG5</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG6</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG7</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG8</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG9</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG10</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG11</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG12</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG13</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG14</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG15</name>
                                            <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG_SUB0</name>
                                            <description>TRIG_SUBx = External trigger input from subscriber port x.</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRIG_SUB1</name>
                                            <description>TRIG_SUBx = External trigger input from subscriber port x.</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>TE</name>
                                <description>Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Triggers are not used.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Triggers are used as selected by the IE, ITSEL and ETSEL fields.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
