therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G110X.svd
                    <register>
                        <name>TIMG7_CTRCTL</name>
                        <description>Counter Control Register</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x0000ff80</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EN</name>
                                <description>Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>REPEAT</name>
                                <description>Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>REPEAT_0</name>
                                            <description>Does not automatically advance following a zero event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_1</name>
                                            <description>Continues to advance following a zero event.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_2</name>
                                            <description>Reserved</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_3</name>
                                            <description>Continues to advance following a zero event if the debug mode is not in effect, or following the release of the debug mode.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_4</name>
                                            <description>Reserved</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CM</name>
                                <description>Count Mode</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DOWN</name>
                                            <description>Down</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>UP_DOWN</name>
                                            <description>Up/Down</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>UP</name>
                                            <description>Counter counts up.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CVAE</name>
                                <description>Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LDVAL</name>
                                            <description>The counter is set to the LOAD register value</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>NOCHANGE</name>
                                            <description>The counter value is unchanged from its current value which could have been initialized by software</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZEROVAL</name>
                                            <description>The counter is set to zero</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DRB</name>
                                <description>Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode.</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>RESUME</name>
                                            <description>Resume counting</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CVAE_ACTION</name>
                                            <description>Perform the action as specified by the CVAE field.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CLC</name>
                                <description>Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCCTL0_LCOND</name>
                                            <description>CCCTL_0 LCOND</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL1_LCOND</name>
                                            <description>CCCTL_1 LCOND</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL2_LCOND</name>
                                            <description>CCCTL_2 LCOND This value exists when there are 4 channels.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL3_LCOND</name>
                                            <description>CCCTL_3 LCOND This value exists when there are 4 channels.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_2INP</name>
                                            <description>Controlled by 2 input QEI mode. This value exists when gptimer support QEI feature.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_3INP</name>
                                            <description>Controlled by 3 input QEI mode.  This value exists when gptimer support QEI feature.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CAC</name>
                                <description>Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCCTL0_ACOND</name>
                                            <description>CCCTL_0 ACOND</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL1_ACOND</name>
                                            <description>CCCTL_1 ACOND</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL2_ACOND</name>
                                            <description>CCCTL_2 ACOND This value exists when there are 4 channels.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL3_ACOND</name>
                                            <description>CCCTL_3 ACOND This value exists when there are 4 channels.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_2INP</name>
                                            <description>Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_3INP</name>
                                            <description>Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CZC</name>
                                <description>Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCCTL0_ZCOND</name>
                                            <description>CCCTL_0 ZCOND</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL1_ZCOND</name>
                                            <description>CCCTL_1 ZCOND</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL2_ZCOND</name>
                                            <description>CCCTL_2 ZCOND This value exists when there are 4 channels.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCCTL3_ZCOND</name>
                                            <description>CCCTL_3 ZCOND This value exists when there are 4 channels.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_2INP</name>
                                            <description>Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>QEI_3INP</name>
                                            <description>Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMG7_LOAD</name>
                        <description>Load Register</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>LD</name>
                                <description>Load Value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMG7_CC_01[%s]</name>
                        <description>Capture or Compare Register 0 to Capture or Compare Register 1</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCVAL</name>
                                <description>Capture or compare value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
